zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2b.c
#if defined(FSRCO_BASE)
/// Define peripheral FSRCO.
const sl_peripheral_val_t sl_peripheral_val_fsrco = { .base = FSRCO_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_FSRCO };
#endif

#if defined(GPCRC_BASE)
/// Define peripheral GPCRC0.
const sl_peripheral_val_t sl_peripheral_val_gpcrc0 = { .base = GPCRC_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                       .bus_clock = SL_BUS_CLOCK_GPCRC0 };
#endif

#if defined(GPIO_BASE)
/// Define peripheral GPIO.
const sl_peripheral_val_t sl_peripheral_val_gpio = { .base = GPIO_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                     .bus_clock = SL_BUS_CLOCK_GPIO };
#endif

#if defined(HFRCO0_BASE)
/// Define peripheral HFRCO0.
const sl_peripheral_val_t sl_peripheral_val_hfrco0 = { .base = HFRCO0_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_HFRCO0 };
#endif

#if defined(HFXO0_BASE)
/// Define peripheral HFXO0.
const sl_peripheral_val_t sl_peripheral_val_hfxo0 = { .base = HFXO0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_HFXO0 };
#endif

#if defined(I2C0_BASE)
/// Define peripheral I2C0.
const sl_peripheral_i2c_val_t sl_peripheral_val_i2c0 = { .base = I2C0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_LSPCLK,
                                                         .bus_clock = SL_BUS_CLOCK_I2C0,
                                                         .dma_signal_rxdatav = SL_DMA_SIGNAL_I2C0_RXDATAV,
                                                         .dma_signal_txbl = SL_DMA_SIGNAL_I2C0_TXBL };
#endif

#if defined(I2C1_BASE)
/// Define peripheral I2C1.
const sl_peripheral_i2c_val_t sl_peripheral_val_i2c1 = { .base = I2C1_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                         .bus_clock = SL_BUS_CLOCK_I2C1,
                                                         .dma_signal_rxdatav = SL_DMA_SIGNAL_I2C1_RXDATAV,
                                                         .dma_signal_txbl = SL_DMA_SIGNAL_I2C1_TXBL };
#endif

#if defined(ADC0_BASE)
/// Define peripheral ADC0.
const sl_peripheral_adc_val_t sl_peripheral_val_adc0 = { .base = ADC0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_ADC0CLK,
                                                         .bus_clock = SL_BUS_CLOCK_ADC0,
                                                         .dma_signal_scan = SL_DMA_SIGNAL_ADC0_SCAN };
#endif

#if defined(ADC1_BASE)
/// Define peripheral ADC1.
const sl_peripheral_adc_val_t sl_peripheral_val_adc1 = { .base = ADC1_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_ADC1CLK,
                                                         .bus_clock = SL_BUS_CLOCK_ADC1,
                                                         .dma_signal_scan = SL_DMA_SIGNAL_ADC1_SCAN };
#endif

#if defined(ICACHE0_BASE)
/// Define peripheral ICACHE0.
const sl_peripheral_val_t sl_peripheral_val_icache0 = { .base = ICACHE0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                        .bus_clock = SL_BUS_CLOCK_ICACHE0 };
#endif

#if defined(LDMAXBAR_BASE)
/// Define peripheral LDMAXBAR0.
const sl_peripheral_ldmaxbar_val_t sl_peripheral_val_ldmaxbar0 = { .base = LDMAXBAR_BASE,
                                                                   .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                                   .bus_clock = SL_BUS_CLOCK_LDMAXBAR0,
                                                                   .dma_signal_prsreq0 = SL_DMA_SIGNAL_LDMAXBAR0_PRSREQ0,
                                                                   .dma_signal_prsreq1 = SL_DMA_SIGNAL_LDMAXBAR0_PRSREQ1 };
#endif

#if defined(LETIMER0_BASE)
/// Define peripheral LETIMER0.
const sl_peripheral_val_t sl_peripheral_val_letimer0 = { .base = LETIMER0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_EM23GRPACLK,
                                                         .bus_clock = SL_BUS_CLOCK_LETIMER0 };
#endif

#if defined(LFRCO_BASE)
/// Define peripheral LFRCO.
const sl_peripheral_val_t sl_peripheral_val_lfrco = { .base = LFRCO_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_LFRCO };
#endif

#if defined(LFXO_BASE)
/// Define peripheral LFXO.
const sl_peripheral_val_t sl_peripheral_val_lfxo = { .base = LFXO_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                     .bus_clock = SL_BUS_CLOCK_LFXO };
#endif

#if defined(LEDSINK0_BASE)
/// Define peripheral LEDSINK.
const sl_peripheral_val_t sl_peripheral_val_ledsink0 = { .base = LEDSINK0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_LEDSINK0CLK,
                                                         .bus_clock = SL_BUS_CLOCK_LEDSINK0 };
#endif

#if defined(MSC_BASE)
/// Define peripheral MSC.
const sl_peripheral_msc_val_t sl_peripheral_val_msc = { .base = MSC_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                        .bus_clock = SL_BUS_CLOCK_MSC,
                                                        .dma_signal_wdata = SL_DMA_SIGNAL_MSC_WDATA };
#endif

