zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2b.c
#if defined(PDM_BASE)
/// Define peripheral PDM.
const sl_peripheral_pdm_val_t sl_peripheral_val_pdm = { .base = PDM_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_EM01GRPBCLK,
                                                        .bus_clock = SL_BUS_CLOCK_PDM,
                                                        .dma_signal_rxdata = SL_DMA_SIGNAL_PDM0_RXDATA };
#endif

#if defined(PRORTC_BASE)
/// Define peripheral PRORTC.
const sl_peripheral_val_t sl_peripheral_val_prortc = { .base = PRORTC_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_PRORTCCLK,
                                                       .bus_clock = SL_BUS_CLOCK_PRORTC };
#endif

#if defined(PRS_BASE)
/// Define peripheral PRS.
const sl_peripheral_val_t sl_peripheral_val_prs = { .base = PRS_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                    .bus_clock = SL_BUS_CLOCK_PRS };
#endif

#if defined(RADIOAES_BASE)
/// Define peripheral RADIOAES.
const sl_peripheral_val_t sl_peripheral_val_radioaes = { .base = RADIOAES_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                         .bus_clock = SL_BUS_CLOCK_RADIOAES };
#endif

#if defined(RTCC_BASE)
/// Define peripheral RTCC.
const sl_peripheral_val_t sl_peripheral_val_rtcc = { .base = RTCC_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_RTCCCLK,
                                                     .bus_clock = SL_BUS_CLOCK_RTCC };
#endif

#if defined(DMEM_BASE)
/// Define peripheral DMEM.
const sl_peripheral_val_t sl_peripheral_val_dmem = { .base = DMEM_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                     .bus_clock = SL_BUS_CLOCK_DMEM };
#endif

#if defined(SMU_BASE)
// Define peripheral SMU.
const sl_peripheral_val_t sl_peripheral_val_smu = { .base = SMU_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                    .bus_clock = SL_BUS_CLOCK_SMU };
#endif

#if defined(SYSCFG_BASE)
/// Define peripheral SYSCFG.
const sl_peripheral_val_t sl_peripheral_val_syscfg = { .base = SYSCFG_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_SYSCFG };
#endif

#if defined(TIMER0_BASE)
/// Define peripheral TIMER0.
const sl_peripheral_timer_val_t sl_peripheral_val_timer0 = { .base = TIMER0_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER0,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER0_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER0_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER0_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER0_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
#endif

#if defined(TIMER1_BASE)
/// Define peripheral TIMER1.
const sl_peripheral_timer_val_t sl_peripheral_val_timer1 = { .base = TIMER1_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER1,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER1_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER1_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER1_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER1_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
#endif

#if defined(TIMER2_BASE)
/// Define peripheral TIMER2.
const sl_peripheral_timer_val_t sl_peripheral_val_timer2 = { .base = TIMER2_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER2,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER2_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER2_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER2_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER2_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
#endif

#if defined(TIMER3_BASE)
/// Define peripheral TIMER3.
const sl_peripheral_timer_val_t sl_peripheral_val_timer3 = { .base = TIMER3_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER3,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER3_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER3_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER3_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER3_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
#endif

#if defined(TIMER4_BASE)
/// Define peripheral TIMER4.
const sl_peripheral_timer_val_t sl_peripheral_val_timer4 = { .base = TIMER4_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER4,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER4_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER4_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER4_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER4_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
#endif

#if defined(ULFRCO_BASE)
/// Define peripheral ULFRCO.
const sl_peripheral_val_t sl_peripheral_val_ulfrco = { .base = ULFRCO_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_ULFRCO };
#endif

#if defined(USART0_BASE)
/// Define peripheral USART0.
const sl_peripheral_usart_val_t sl_peripheral_val_usart0 = { .base = USART0_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                             .bus_clock = SL_BUS_CLOCK_USART0,
                                                             .dma_signal_rxdatav = SL_DMA_SIGNAL_USART0_RXDATAV,
                                                             .dma_signal_rxdatavright = SL_DMA_SIGNAL_USART0_RXDATAVRIGHT,
                                                             .dma_signal_txbl = SL_DMA_SIGNAL_USART0_TXBL,
                                                             .dma_signal_txblright = SL_DMA_SIGNAL_USART0_TXBLRIGHT,
                                                             .dma_signal_txempty = SL_DMA_SIGNAL_USART0_TXEMPTY };
#endif

#if defined(USART1_BASE)
/// Define peripheral USART1.
const sl_peripheral_usart_val_t sl_peripheral_val_usart1 = { .base = USART1_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                             .bus_clock = SL_BUS_CLOCK_USART1,
                                                             .dma_signal_rxdatav = SL_DMA_SIGNAL_USART1_RXDATAV,
                                                             .dma_signal_rxdatavright = SL_DMA_SIGNAL_USART1_RXDATAVRIGHT,
                                                             .dma_signal_txbl = SL_DMA_SIGNAL_USART1_TXBL,
                                                             .dma_signal_txblright = SL_DMA_SIGNAL_USART1_TXBLRIGHT,
                                                             .dma_signal_txempty = SL_DMA_SIGNAL_USART1_TXEMPTY };
#endif

#if defined(WDOG0_BASE)
/// Define peripheral WDOG0.
const sl_peripheral_val_t sl_peripheral_val_wdog0 = { .base = WDOG0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_WDOG0CLK,
                                                      .bus_clock = SL_BUS_CLOCK_WDOG0 };
#endif

/** @} (end addtogroup device_peripheral) */

/***************************************************************************//**
 * @addtogroup device_peripheral_dma Device Abstraction DMA Peripheral
 * @{
 ******************************************************************************/

#if defined(LDMA_BASE)
/// Define DMA peripheral LDMA.
const sl_peripheral_dma_val_t sl_peripheral_dma_val_ldma0 = { .base = LDMA_BASE,
                                                              .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                              .bus_clock = SL_BUS_CLOCK_LDMA0,
                                                              .nbr_channel = 8,
                                                              .nbr_sync = 8,
                                                              .dual_destination_map = 0,
                                                              .rule_based_interleaving_map = 0 };
#endif

/** @} (end addtogroup device_peripheral_dma) */
